Embedfire-emwin/ebf_stm32f103_mini_emwin_demo/24-1. ucos_emWin_创建USB应用（SD+FLASH版本）/User/BSP/bsp.h
/*
*********************************************************************************************************
*                                     MICIRUM BOARD SUPPORT PACKAGE
*
*                             (c) Copyright 2013; Micrium, Inc.; Weston, FL
*
*               All rights reserved.  Protected by international copyright laws.
*               Knowledge of the source code may NOT be used to develop a similar product.
*               Please help us continue to provide the Embedded community with the finest
*               software available.  Your honesty is greatly appreciated.
*********************************************************************************************************
*/

/*
*********************************************************************************************************
*
*                                        BOARD SUPPORT PACKAGE
*
*                                     ST Microelectronics STM32
*                                              on the
*
*                                     Micrium uC-Eval-STM32F107
*                                        Evaluation Board
*
* Filename      : bsp.h
* Version       : V1.00
* Programmer(s) : EHS
*********************************************************************************************************
*/

/*
*********************************************************************************************************
*                                                 MODULE
*
* Note(s) : (1) This header file is protected from multiple pre-processor inclusion through use of the
*               BSP present pre-processor macro definition.
*********************************************************************************************************
*/

#ifndef  BSP_PRESENT
#define  BSP_PRESENT


/*
*********************************************************************************************************
*                                                 EXTERNS
*********************************************************************************************************
*/

#ifdef   BSP_MODULE
#define  BSP_EXT
#else
#define  BSP_EXT  extern
#endif


/*
*********************************************************************************************************
*                                              INCLUDE FILES
*********************************************************************************************************
*/

#include  <stdarg.h>
#include  <stdio.h>

#include  <cpu.h>
#include  <cpu_core.h>

#include  <lib_ascii.h>
#include  <lib_def.h>
#include  <lib_mem.h>
#include  <lib_str.h>

#include "stm32f10x.h"          // Modified by fire (Ô­ÊÇ #include  <stm32f10x_lib.h>)  

#include  <app_cfg.h>

#include "./led/bsp_led.h"           
#include "./usart/bsp_usart.h"
#include "./tpad/bsp_tpad.h"
#include "./Beep/bsp_beep.h"
#include "./fatfs/drivers/fatfs_flash_spi.h"


/*
*********************************************************************************************************
*                                          GPIO PIN DEFINITIONS
*********************************************************************************************************
*/



/*
*********************************************************************************************************
*                                               INT DEFINES
*********************************************************************************************************
*/
#define   BSP_OK              (uint32_t)     0       // Õý³£
#define   BSP_OS              (uint32_t)0x0001       // ucosÏµÍ³´íÎó
#define   BSP_LCD            (uint32_t)0x0002         // SRAM´íÎó
#define   BSP_GTP             (uint32_t)0x0004       // ´¥ÃþÆÁ´íÎó
#define   BSP_TPAD            (uint32_t)0x0008       // µçÈÝ°´¼ü       
#define   BSP_SD              (uint32_t)0x0010       // SD¿¨´íÎó
#define   BSP_SPI_FLASH       (uint32_t)0x0020       // FLASHÇý¶¯´íÎó
#define   BSP_FILE_SYSTEM    (uint32_t)0x0040       // FLASHÇý¶¯´íÎó
#define   BSP_XBF             (uint32_t)0x0080       //  XBF×ÖÌå´íÎó
#define   BSP_GUI             (uint32_t)0x0100       // emwinÔËÐÐ´íÎó 
#define   BSP_WM8978          (uint32_t)0x0200       //  The WM8978 drive cannot work           
#define   BSP_ALLOC           (uint32_t)0x0400       //  ´æ´¢Æ÷ alloc ´íÎó
#define   BSP_RTC             (uint32_t)0x0800       //  RTC¹¤×÷´íÎó
#define   BSP_NETWORK         (uint32_t)0x1000       // ÒÔÌ«Íø´íÎó
#define   BSP_CAMERA          (uint32_t)0x2000       // ÉãÏñÍ·´íÎó

#define   BSP_ERROR_NUM				15	//bsp´íÎóÖÖÀà



/*
*********************************************************************************************************
*                                             PERIPH DEFINES
*********************************************************************************************************
*/



/*
*********************************************************************************************************
*                                               DATA TYPES
*********************************************************************************************************
*/


/*
*********************************************************************************************************
*                                            GLOBAL VARIABLES
*********************************************************************************************************
*/
extern uint32_t bsp_result;


/*
*********************************************************************************************************
*                                                 MACRO'S
*********************************************************************************************************
*/


/*
*********************************************************************************************************
*                                           FUNCTION PROTOTYPES
*********************************************************************************************************
*/
void 	Hardware_Error_Check(void);
void  BSP_Init(void);
void 	BSP_Tick_Init(void);
void bsp_DelayUS(uint32_t _ulDelayTime);
void Soft_Reset(void);

#define bsp_DelayMS(x) bsp_DelayUS(x*1000)

CPU_INT32U   BSP_CPU_ClkFreq             (void);


/*
*********************************************************************************************************
*                                           INTERRUPT SERVICES
*********************************************************************************************************
*/



/*
*********************************************************************************************************
*                                     PERIPHERAL POWER/CLOCK SERVICES
*********************************************************************************************************
*/



/*
*********************************************************************************************************
*                                              LED SERVICES
*********************************************************************************************************
*/


/*
*********************************************************************************************************
*                                              STATUS INPUTS
*********************************************************************************************************
*/



/*
*********************************************************************************************************
*                                             MODULE END
*********************************************************************************************************
*/


#endif                                                          /* End of module include.                               */




